# Electrical Per Phase Data Class

Source: https://www.revitapidocs.com/2026/e1f42674-e9e7-3ec6-ebe7-4b88d6f75855.htm

---

| Electrical Per Phase Data Class |
| --- |

This class represents per phase values including current and power. Inheritance Hierarchy System Object
Autodesk.Revit.DB.Electrical ElectricalPerPhaseData

**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class ElectricalPerPhaseData : IDisposable
```

```
Public Class ElectricalPerPhaseData
	Implements IDisposable
```

```
public ref class ElectricalPerPhaseData : IDisposable
```

```
type ElectricalPerPhaseData =
    class
        interface IDisposable
    end
```
The ElectricalPerPhaseData type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | CurrentPhaseA | The effective value of current on electrical phase A. |
|  | CurrentPhaseB | The effective value of current on electrical phase B. |
|  | CurrentPhaseC | The effective value of current on electrical phase C. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ElectricalPerPhaseData |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

Autodesk.Revit.DB.Electrical Namespace